Documents/УдостоверениеКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УдостоверениеКачества</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУдостоверенияКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ФормаУдостоверенияКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/umk_НастройкиУдостоверенияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_НастройкиУдостоверенияКачества</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировкиКатегории</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаУдостоверенияКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ФормаУдостоверенияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_СрокГодности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_КатегорияПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оболочка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ВидыОперацийКомплектацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийКомплектацияНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разукомплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УдостоверениеКачества/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
// Функция формирует табличный документ с печатной формой накладной,
	// разработанной методистами
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма накладной
	//
Функция ПечатьДокумента(Отбор)
		
	Перем Номенклатура;
		
	Регистратор = ПолучитьПоследнийРегистратор();
	
	Если Регистратор = Неопределено Тогда
		Возврат Неопределено
	КонецЕсли;
	
	// КонецПоРегистратору
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомерДляПечати КАК Номер,
	|	Дата,
	|	Организация,
	|   Организация.Наименование КАК ОрганизацияНаименование,
	|   Организация.Наименование КАК ОрганизацияНаименование_,
	|	Ответственный
	|ИЗ
	|	Документ.УдостоверениеКачества КАК УдостоверениеКачества
	|
	|ГДЕ
	|   УдостоверениеКачества.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_umk_УдостоверениеКачества";
	
	Макет = ПолучитьМакет("Удостоверение");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	
	СведенияО_Организации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата,,,КодЯзыкаПечать);
	
	ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОбластьМакетаЗаголовок.Параметры.Заполнить(Шапка);
	ОбластьМакетаЗаголовок.Параметры.Дата = Формат(Шапка.Дата,"ДФ=dd.MM.yyyy");
	
	Если ЗначениеЗаполнено(Регистратор.ОрганизацияАльт) тогда
		ОбластьМакетаЗаголовок.Параметры.ОрганизацияНаименование_ = Регистратор.ОрганизацияАльт
	КонецЕсли;
	
	
	// Банк
	Сведения = Новый Структура;
	Сведения.Вставить("НомерСчета",       СведенияО_Организации.НомерСчета);
	Сведения.Вставить("Банк",             СведенияО_Организации.Банк);
	Сведения.Вставить("МФО",              СведенияО_Организации.МФО);
	
	ОбластьМакетаЗаголовок.Параметры.БанковскиеРеквизиты = ФормированиеПечатныхФорм.ОписаниеОрганизации(Сведения, "НомерСчета,Банк,МФО",,КодЯзыкаПечать);
	ОбластьМакетаЗаголовок.Параметры.ЮрАдрес             = СведенияО_Организации.ЮридическийАдрес;
	ОбластьМакетаЗаголовок.Параметры.Телефон             = СведенияО_Организации.Телефоны;
	ОбластьМакетаЗаголовок.Параметры.ИНН                 = СведенияО_Организации.ИНН;
	ОбластьМакетаЗаголовок.Параметры.КодПоЕДРПОУ         = СведенияО_Организации.КодПоЕДРПОУ;
	ОбластьМакетаЗаголовок.Параметры.НомерСвидетельства  = СведенияО_Организации.НомерСвидетельства;
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьМакетаШапка.Параметры.СрокГодностиЗаголовок = Регистратор.СрокГодностиЗаголовок;
	
	Если ДанныеКонтрагента Тогда
		
		ОбластьМакетКонтрагент = Макет.ПолучитьОбласть("ОбластьКонтрагент");
		
		СведенияО_Контрагенте = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДокументОснование.Контрагент, Шапка.Дата,,,КодЯзыкаПечать);
		
		СведенияКотрагент = Новый Структура;
		СведенияКотрагент.Вставить("ПолноеНаименование",       СведенияО_Контрагенте.ПолноеНаименование);
		АдресДоставки = СокрЛП(ДокументОснование.АдресДоставки);
		
		ОбластьМакетКонтрагент.Параметры.ДанныеКонтрагента = "     Товароотримувач: "
		+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияКотрагент, "ПолноеНаименование",,КодЯзыкаПечать)
		+ " ." + АдресДоставки;
	
	КонецЕсли;

	Если Отбор Тогда
		
		Номенклатура = ЭтотОбъект.ДокументОснование.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УК_Настройки.Номенклатура
		|ИЗ
		|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор = &Регистратор) КАК УК_Настройки";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		
		Результат = Запрос.Выполнить().Выгрузить();
				
		Для Каждого ЭлНоменклатуры Из Номенклатура Цикл
			
			ПарамПоиска = Новый Структура("Номенклатура", ЭлНоменклатуры);
			РезультатПоиска = Результат.НайтиСтроки(ПарамПоиска);
			
			Если РезультатПоиска.Количество() = 0 Тогда
				Сообщить(Строка(Регистратор) + Нстр("ru = '. Отстутствует номенклатура - '; uk = '. Відсутня номенклатура - '") + Строка(ЭлНоменклатуры));
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
		
	// Выборка по страницам
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УК_Настройки.НомерСтраницы
	|ИЗ
	|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Регистратор = &Регистратор) КАК УК_Настройки" + ?(Отбор,"
	|ГДЕ
	|	УК_Настройки.Номенклатура В(&Номенклатура)","") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	УК_Настройки.НомерСтраницы";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоСтраницам = РезультатЗапроса.Выбрать();
	
	ЭтоПерваяСтраница = Истина;
	
	НомерСтраницы = 1;
	нпп = 1;
	
	//Заголовок первой страницы
	ОбластьМакетаЗаголовок.Параметры.Страница = НомерСтраницы;
	ОбластьМакетаЗаголовок.Параметры.Страниц = ВыборкаПоСтраницам.Количество();
	ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
	
	Если ДанныеКонтрагента Тогда
		
		ТабДокумент.Вывести(ОбластьМакетКонтрагент);
		
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	Пока ВыборкаПоСтраницам.Следующий() Цикл   // Первая итерация по номерам страниц
		
		Если Не НомерСтраницы =  ВыборкаПоСтраницам.НомерСтраницы 
			Тогда
			НомерСтраницы =  ВыборкаПоСтраницам.НомерСтраницы;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		
		Если Не НомерСтраницы = 1 Тогда  // Выведем заголовок на каждой странице
			ОбластьМакетаЗаголовок.Параметры.Страница = НомерСтраницы;
			ОбластьМакетаЗаголовок.Параметры.Страниц = ВыборкаПоСтраницам.Количество();
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			ТабДокумент.Вывести(ОбластьМакетаШапка);
		КонецЕсли;
			
		// Выбираем категории товаров
		
		ОбластьМакетаКатегория = Макет.ПолучитьОбласть("Категория");
		ОбластьСтрокаТаблицы   = Макет.ПолучитьОбласть("СтрокаТаблицы");
		//нпп = 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УК_Настройки.КатегорияПродукции КАК КатегорияПродукции,
		|	УК_Настройки.ПорядокСортировкиКатегории КАК ПорядокСортировкиКатегории
		|ИЗ
		|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор = &Регистратор) КАК УК_Настройки
		|ГДЕ
		|	УК_Настройки.НомерСтраницы = &НомерСтраницы" + ?(Отбор,"
		|	И УК_Настройки.Номенклатура В(&Номенклатура)","") + "
		|
		|СГРУППИРОВАТЬ ПО
		|	УК_Настройки.КатегорияПродукции,
		|	УК_Настройки.ПорядокСортировкиКатегории
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСортировкиКатегории";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Регистратор",Регистратор);
		Запрос.УстановитьПараметр("НомерСтраницы",НомерСтраницы);
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);	
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаКатегории = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаКатегории.Следующий() Цикл
			
			ОбластьМакетаКатегория.Параметры.КатегорияПродукции = ВыборкаКатегории.КатегорияПродукции;
			
			ТабДокумент.Вывести(ОбластьМакетаКатегория); // Выводим область Категории товара
			
			// Группируем по сроку годности с отбором по категории
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УК_Настройки.НаименованиеДляПечати КАК Наименование,
			|	УК_Настройки.Сорт,
			|	УК_Настройки.Оболочка,
			|	УК_Настройки.Номенклатура.Артикул КАК ДСТУ,
			|	УК_Настройки.СрокГодности КАК СрокГодности,
			|	УК_Настройки.ПорядокСортировки КАК ПорядокСортировки,
			|	УК_Настройки.НомерСтраницы,
			|	УК_Настройки.Номенклатура,
			|	УК_Настройки.Номенклатура.Код КАК КодС
			|ИЗ
			|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И КатегорияПродукции = &КатегорияПродукции
			|				И Регистратор = &Регистратор) КАК УК_Настройки
			|ГДЕ
			|	УК_Настройки.НомерСтраницы = &НомерСтраницы" + ?(Отбор,"
			|	И УК_Настройки.Номенклатура В(&Номенклатура)","") + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядокСортировки
			|ИТОГИ ПО
			|	СрокГодности";
			
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("Период", Дата);
			Запрос.УстановитьПараметр("Регистратор",Регистратор);
			Запрос.УстановитьПараметр("КатегорияПродукции",
			ВыборкаКатегории.КатегорияПродукции);
			Запрос.УстановитьПараметр("НомерСтраницы",НомерСтраницы);
			
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);				   
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаПоСрокуГодности = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			
			Пока ВыборкаПоСрокуГодности.Следующий() Цикл 
				
				ВысотаДоОбъединения = ТабДокумент.ВысотаТаблицы;
				
				ВысотаПослеОбъединения = ВысотаДоОбъединения;
				
				ВыборкаПоТоварам = ВыборкаПоСрокуГодности.Выбрать();
				
				
				Пока ВыборкаПоТоварам.Следующий() Цикл
					
					
					ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоТоварам);
					ОбластьСтрокаТаблицы.Параметры.ДатаИзготовления = ПолучитьДатуПартии(ВыборкаПоТоварам.Номенклатура);
					ОбластьСтрокаТаблицы.Параметры.нпп = нпп;
					ТабДокумент.Вывести(ОбластьСтрокаТаблицы);
					
					ВысотаПослеОбъединения = ВысотаПослеОбъединения + 1;	
					нпп = нпп + 1;
					
				КонецЦикла;
				
				ОбластьОбъединения = ТабДокумент.Область(ВысотаДоОбъединения +1 ,11, ВысотаПослеОбъединения,15);
				ОбластьОбъединения.Объединить();
				ОбластьОбъединения.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				ОбластьОбъединения.Текст = ВыборкаПоСрокуГодности.СрокГодности.ПредставлениеПечати;
				ОбластьОбъединения.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				ОбластьОбъединения.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
				ОбластьОбъединения.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Авто;
				
			КонецЦикла; // По сроку годности
			
		КонецЦикла; // По Категории
		
		Если НомерСтраницы%2 = 0 Или ВыборкаПоСтраницам.Количество() = НомерСтраницы  Тогда
			
			Если ВыборкаПоСтраницам.Количество() = НомерСтраницы Тогда // Последняяя страница
				
				ОбластьТекстПодвала = Макет.ПолучитьОбласть("СтрокаТестПодвала");
				Если Не Регистратор = Неопределено Тогда
					ОбластьТекстПодвала.Параметры.ТекстПодвала = Регистратор.ТекстПодвала;
				КонецЕсли;
				ТабДокумент.Вывести(ОбластьТекстПодвала);
				
				
			КонецЕсли;
			
			
			ОбластьТекстПодписи = Макет.ПолучитьОбласть("Подписи");
			ОбластьТекстПодписи.Параметры.Ответственный = Ответственный.Наименование;
			ТабДокумент.Вывести(ОбластьТекстПодписи);
			
		КонецЕсли;
		
		
	КонецЦикла; // По Страницам
	
	
	Возврат ТабДокумент;
	
КонецФункции //ПечатьДокумента()
	
// Функция формирует табличный документ с печатной формой накладной,
	// разработанной методистами
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма накладной
	//
Функция ПечатьДекларацияПроизводителя(Отбор)
	
	//Пока задача снята
	
КонецФункции //ПечатьДекларацияПроизводителя()

// Функция печать остатков готовой продукции не вошедшей в удостоверение
Функция ПечатьОстаткиПродукции()
		
		// Получим продукцию из настроек УК
		Регистратор = ПолучитьПоследнийРегистратор();
		
		Если Регистратор = Неопределено Тогда
			Возврат Неопределено
		КонецЕсли;
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_umk_УдостоверениеКачестваОстаткиПродукции";
		
		Макет = ПолучитьМакет("ОстатокПродукции");
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Номенклатура
		|ИЗ
		|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор = &Регистратор) КАК umk_НастройкиУдостоверенияКачестваСрезПоследних";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Регистратор",Регистратор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		НоменклатураУК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		// Получим остатки не вошедшие в УК отличные от "0". 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.КоличествоОстаток КАК Остаток,
		|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Дата,
		|			Счет В ИЕРАРХИИ (&СчетГП),
		|			,
		|			Организация = &Организация
		|				И НЕ Субконто1 В (&НоменклатураУК)
		|				И Субконто2 = &Склад) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток <> 0";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("НоменклатураУК", НоменклатураУК);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Склад", Константы.umk_СкладПродукции.Получить());
		Запрос.УстановитьПараметр("СчетГП", ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			Возврат Неопределено
		КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Дата = Дата;
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТовар");
		
		ТабДокумент.Вывести(ОбластьШапка);
		нпп = 1;
		Пока Выборка.Следующий() Цикл
			ОбластьСтрока.Параметры.нпп = нпп;
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьСтрока);
			нпп = нпп + 1;		
		КонецЦикла;
		
		ТабДокумент.Защита = Истина;
		
		Возврат ТабДокумент
		
	КонецФункции  // ПечатьОстаткиПродукции()
	
//Дата выпуска продукции последнего документа
Функция ПолучитьДатуПартии(Номенклатура)
		
		
		ТаблицаДокумента = ?(Номенклатура.ДатаВыпускаПоКомплектации, "КомплектацияНоменклатуры", "ОтчетПроизводстваЗаСмену.Продукция");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументВыпуска.Ссылка.Дата КАК Дата,
		|	ДокументВыпуска.Номенклатура
		|ИЗ
		|	Документ." + ТаблицаДокумента + " КАК ДокументВыпуска
		|ГДЕ
		|	ДокументВыпуска.Номенклатура = &Номенклатура
		|	И ДокументВыпуска.Ссылка.Дата <= &Дата
		|	И ДокументВыпуска.Ссылка.Проведен" +
		?(Номенклатура.ДатаВыпускаПоКомплектации, 
		"   И ДокументВыпуска.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКомплектацияНоменклатуры.Комплектация)", "") + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументВыпуска.Ссылка.Дата,
		|	ДокументВыпуска.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Формат(Выборка.Дата, "ДФ=dd.MM.yyyy")
		Иначе
			Возврат ""
		КонецЕсли;
		
		
	КонецФункции
	
// Функция осуществляет запуск обработки формирующей печатную форму "Бланк товарного наполнения".
	//
	// Параметры:
	//  НаПринтер - Булево. Если Истина, тогда печать выполняется непосредственно на принтер.
	//
	// Возвращаемое значение:
	//  Неопределено.
	//
Функция ПечатьБланк(НаПринтер)
		
		Обработки.ПечатьРаскладкиНоменклатурыПоМестамХранения.Создать().НапечататьИзДокумента(Ссылка, , , НаПринтер);
		
		Возврат Неопределено;
		
	КонецФункции // ПечатьБланк()
	
// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
		
		
		Если  ИмяМакета = "ПроверитьОстаткиПродукции" Тогда
			
			ТабДокумент = ПечатьОстаткиПродукции();
			
			Если Не ТабДокумент = Неопределено
				Тогда
				ТабДокумент.Показать();
			Иначе
				Предупреждение("Остаток отсутствует!");
			КонецЕсли;
			
			Возврат
			
		КонецЕсли;
		
		Отбор = ЗначениеЗаполнено(ДокументОснование);
		
		
		Если ИмяМакета = "ДекларацияПроизводителя" Тогда
			ТабДокумент = ПечатьДекларацияПроизводителя(Отбор);
			Возврат  //Пока задача снята
		КонецЕсли;
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "Удостоверение" Тогда
			ТабДокумент = ПечатьДокумента(Отбор);
		КонецЕсли;
		
		Регистратор = ПолучитьПоследнийРегистратор();
		// Проверим по регистратору наличие печатной формы
		Если Не Регистратор = Неопределено Тогда 
			ВыборкаПоОбъектуПечати = umk_Доработки.ВыборкаПоОбъектуПечати(Регистратор);
			Если ВыборкаПоОбъектуПечати.Следующий() Тогда
				ОбъектПечати = Регистратор //Берем пф из регистратора
			Иначе  // Проверим наличие ПФ по ссылке
				ВыборкаПоОбъектуПечати = umk_Доработки.ВыборкаПоОбъектуПечати(Ссылка);
				Если ВыборкаПоОбъектуПечати.Следующий()
					Тогда
					ОбъектПечати = ссылка;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ОбъектПечати = Ссылка;
		КонецЕсли;
		
		
		umk_Доработки.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер,ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), ОбъектПечати,,Истина,Ссылка);
		
		
КонецПроцедуры // Печать
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("Удостоверение"    , "Удостоверение качества");
	СтруктураМакетов.Вставить("ДекларацияПроизводителя"    , "Декларація виробника");

	СтруктураМакетов.Вставить("ПроверитьОстаткиПродукции"    , "Проверить остатки продукции");
	
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	ПоследнийНомер = ПолучитьПоследнийНомер();
	ПоследнийНомер = Число(ПоследнийНомер);
	ПоследнийНомер =  ПоследнийНомер + 1 ;
	
	Номер = Формат(ПоследнийНомер,  "ЧЦ=9; ЧВН=; ЧГ=");
	НомерДляПечати = Номер;
	
КонецПроцедуры

Функция ПолучитьПоследнийНомер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УдостоверениеКачества.Номер КАК Номер
	|ИЗ
	|	Документ.УдостоверениеКачества КАК УдостоверениеКачества
	|ГДЕ
	|	УдостоверениеКачества.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаКонца", КонецГода(Дата));
	Запрос.УстановитьПараметр("ДатаНачала",НачалоГода(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номер 
	Иначе
		Возврат "0"
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьПоследнийРегистратор()
	// Выбираем последний документ регистратор  по нашей форме
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Регистратор,
	|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.umk_НастройкиУдостоверенияКачества.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ФормаУдостоверенияКачества = &ФормаУдостоверенияКачества) КАК umk_НастройкиУдостоверенияКачестваСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Регистратор,
	|	umk_НастройкиУдостоверенияКачестваСрезПоследних.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	Запрос.УстановитьПараметр("ФормаУдостоверенияКачества", ФормаУдостоверенияКачества);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Регистратор;
	
КонецФункции
